Core/src/Documents/СправкиСПАРКРиски/СправкиСПАРКРиски.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СправкиСПАРКРиски</name>
  <posting>Deny</posting>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>DefinedType.КонтрагентБИП</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияСправкиСПАРКРиски</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
</mdclass:Document>

Core/src/Enums/ВидыОшибокСПАРКРиски/ВидыОшибокСПАРКРиски.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОшибокСПАРКРиски</name>
  <enumValues>
    <name>ВнутренняяОшибкаСервиса</name>
  </enumValues>
  <enumValues>
    <name>ИнтернетПоддержкаНеПодключена</name>
  </enumValues>
  <enumValues>
    <name>ИспользованиеЗапрещено</name>
  </enumValues>
  <enumValues>
    <name>ИспользованиеОтключено</name>
  </enumValues>
  <enumValues>
    <name>НеизвестнаяОшибка</name>
  </enumValues>
  <enumValues>
    <name>НеизвестныйИНН</name>
  </enumValues>
  <enumValues>
    <name>НекорректныйЗапрос</name>
  </enumValues>
  <enumValues>
    <name>НекорректныйИНН</name>
  </enumValues>
  <enumValues>
    <name>НеПодлежитПроверке</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаАутентификации</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаПодключения</name>
  </enumValues>
  <enumValues>
    <name>ПревышеноКоличествоПопытокАутентификации</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяОплатаИлиПревышенЛимит</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/СостоянияСправкиСПАРКРиски/СостоянияСправкиСПАРКРиски.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияСправкиСПАРКРиски</name>
  <enumValues>
    <name>Готовится</name>
  </enumValues>
  <enumValues>
    <name>Получена</name>
  </enumValues>
  <enumValues>
    <name>НеизвестныйИНН</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаПодготовки</name>
  </enumValues>
</mdclass:Enum>

Core/src/Catalogs/СправкиСПАРКРискиПрисоединенныеФайлы/СправкиСПАРКРискиПрисоединенныеФайлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СправкиСПАРКРискиПрисоединенныеФайлы</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецФайла</name>
    <type>
      <types>DocumentRef.СправкиСПАРКРиски</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаМодификацииУниверсальная</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Зашифрован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Изменил</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанЭП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Редактирует</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусИзвлеченияТекста</name>
    <type>
      <types>EnumRef.СтатусыИзвлеченияТекстаФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипХраненияФайла</name>
    <type>
      <types>EnumRef.ТипыХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>Том</name>
    <type>
      <types>CatalogRef.ТомаХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЭлектронныеПодписи</name>
    <attributes>
      <name>ДатаПодписи</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяФайлаПодписи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>260</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КомуВыданСертификат</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Отпечаток</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>28</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подпись</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>УстановившийПодпись</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПроверкиПодписи</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодписьВерна</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СертификатыШифрования</name>
    <attributes>
      <name>Отпечаток</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>28</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/Documents/СправкиСПАРКРиски/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не СПАРКРиски.ИспользованиеРазрешено() Тогда
		Элементы.ГруппаПанель.Видимость = Ложь;
		Элементы.КакНастроитьAdobeReader.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Элементы.ЗапроситьСправку.Видимость = Пользователи.РолиДоступны("ЗапросНовойСправкиСПАРКРиски", , Ложь);
	Если ЗначениеЗаполнено(Параметры.Контрагент) Тогда
		
		Контрагент = Параметры.Контрагент;
		
		// Проверка корректности параметра отбора.
		СвойстваСправочниковКонтрагенты = СПАРКРиски.СвойстваСправочниковКонтрагентов();
		ТипКонтрагент = ТипЗнч(Контрагент);
		
		ОписаниеСправочника = СвойстваСправочниковКонтрагенты.Найти(ТипКонтрагент, "ТипСсылка");
		Если ОписаниеСправочника = Неопределено Тогда
			ТекстИсключения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ka='Неизвестный тип контрагента (%1). Необходимо заполнить описание справочника в методе"
"ПриОпределенииСвойствСправочниковКонтрагентов() общего модуля СПАРКРискиПереопределяемый.';ru='Неизвестный тип контрагента (%1). Необходимо заполнить описание справочника в методе"
"ПриОпределенииСвойствСправочниковКонтрагентов() общего модуля СПАРКРискиПереопределяемый.'"),
				ТипКонтрагент);
			ВызватьИсключение ТекстИсключения;
		КонецЕсли;
		
		Если ОписаниеСправочника.Иерархический
			И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "ЭтоГруппа") = Истина Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				НСтр("ka='Получение справок 1СПАРК Риски недоступно для группы. Выберите элемент справочника.';ru='Получение справок 1СПАРК Риски недоступно для группы. Выберите элемент справочника.';en='Get help 1SPARK risks is not available for groups. Select the directory entry.'"));
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		// Настройка отображения элементов формы.
		Элементы.ГруппаКонтрагентОтбор.Видимость = Ложь;
		Элементы.Контрагент.Видимость            = Ложь;
		
		// Установить отбор в списке.
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Контрагент", Контрагент);
		
		Элементы.КонтрагентОтборГиперссылка.Видимость = Параметры.ПоказыватьОтбор;
		Если Параметры.ПоказыватьОтбор Тогда
			Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ka='Справки 1СПАРК Риски: %1';ru='Справки 1СПАРК Риски: %1';en='Help 1SPARK Risks: 1%'"),
				ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Контрагент, "Наименование"));
		КонецЕсли;
		
	Иначе
		
		Элементы.КонтрагентОтборГиперссылка.Видимость = Ложь;
		
	КонецЕсли;
	//Паганини_
	ФункционалЗапретаРедактированияДокументов = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ФункционалЗапретаРедактированияДокументов");
	//_Паганини
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КонтрагентОтборПриИзменении(Элемент)
	
	УстановитьОтборПоКонтрагенту();
	
КонецПроцедуры

&НаКлиенте
Процедура КакНастроитьAdobeReader(Команда)
	
	ОткрытьФорму("Обработка.СправкаСПАРКРиски.Форма.СправочнаяИнформация",
		Новый Структура(
			"ИмяМакета",
			"КакНастроитьПроверкуЦифровойПодписиAdobeAcrobat"));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ВыбраннаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСтроки = Элементы.Список.ДанныеСтроки(ВыбраннаяСтрока);
	ОткрытьСправкуСПАРКРиски(Неопределено, ДанныеСтроки.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура ЗапроситьСправку(Команда)
	
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ka='Поле ""Контрагент"" не заполнено.';ru='Поле ""Контрагент"" не заполнено.';en='The ""Contractor"" is not filled.'"),
			,
			"Контрагент");
		Возврат;
	КонецЕсли;
	
	ЗапроситьНовуюСправку();
	
КонецПроцедуры

&НаКлиенте
Процедура ВсеПолученныеСправки(Команда)
	
	ИнтернетПоддержкаПользователейКлиент.ОткрытьВебСтраницу(
		СПАРКРискиКлиентСервер.АдресСтраницыЛичныйКабинетВсеСправки(),
		НСтр("ka='Справки 1СПАРК Риски';ru='Справки 1СПАРК Риски';en='Help 1SPARK Risks'"));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьСправкуСПАРКРиски(Результат, СправкаСсылка) Экспорт
	
	Состояние(, , НСтр("ka='Открытие справки 1СПАРК Риски...';ru='Открытие справки 1СПАРК Риски...';en='Opens the help 1SPARK Risks ...'"));
	РезультатПолученияДанныхФайла = ДанныеДляПросмотраФайлаСправки(СправкаСсылка);
	Состояние();
	Если РезультатПолученияДанныхФайла.ДанныеФайла <> Неопределено Тогда
		
		ПрисоединенныеФайлыКлиент.ОткрытьФайл(РезультатПолученияДанныхФайла.ДанныеФайла, Ложь);
		
	ИначеЕсли РезультатПолученияДанныхФайла.ВидОшибки.Пустая() Тогда
		
		Если Не ПустаяСтрока(РезультатПолученияДанныхФайла.Сообщение) Тогда
			ПоказатьПредупреждение(, РезультатПолученияДанныхФайла.Сообщение);
		КонецЕсли;
		
	Иначе
		
		ОбработатьОшибку(
			РезультатПолученияДанныхФайла,
			Новый ОписаниеОповещения("ОткрытьСправкуСПАРКРиски", ЭтотОбъект, СправкаСсылка));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоКонтрагенту()
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Список.Отбор,
			"Контрагент",
			Контрагент,
			,
			,
			Истина);
		
	Иначе
		
		ОтборыПоКонтрагенту = ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(Список.Отбор, "Контрагент");
		Для Каждого ТекущийОтбор Из ОтборыПоКонтрагенту Цикл
			ТекущийОтбор.Использование = Ложь;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапроситьНовуюСправку(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Состояние(, , НСтр("ka='Запрос новой справки 1СПАРК Риски';ru='Запрос новой справки 1СПАРК Риски';en='Request a new certificate 1SPARK Risks'"));
	РезультатЗапросаСправки = ЗапроситьНовуюСправкуВСервисеСПАРКРиски();
	Состояние();
	
	Если Не РезультатЗапросаСправки.СправкаСсылка.Пустая() Тогда
		
		Элементы.Список.ТекущаяСтрока = РезультатЗапросаСправки.СправкаСсылка;
		ПоказатьОповещениеПользователя(
			НСтр("ka='Справки 1СПАРК Риски';ru='Справки 1СПАРК Риски';en='Help 1SPARK Risks'"),
			,
			НСтр("ka='Подготовка новой справки 1СПАРК Риски.';ru='Подготовка новой справки 1СПАРК Риски.';en='Prepare the new reference 1SPARK risks.'"),
			БиблиотекаКартинок.Информация32);
		
	ИначеЕсли РезультатЗапросаСправки.ВидОшибки.Пустая() Тогда
		
		Если Элементы.ГруппаКонтрагентОтбор.Видимость Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				РезультатЗапросаСправки.Сообщение,
				,
				"Контрагент");
			
		Иначе
			
			ПоказатьПредупреждение(, РезультатЗапросаСправки.Сообщение);
			
		КонецЕсли;
		
	ИначеЕсли Не ПустаяСтрока(РезультатЗапросаСправки.Сообщение) Тогда
		
		ПоказатьПредупреждение(, РезультатЗапросаСправки.Сообщение);
		
	Иначе
		
		ОбработатьОшибку(
			РезультатЗапросаСправки,
			Новый ОписаниеОповещения("ЗапроситьНовуюСправку", ЭтотОбъект));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОшибку(РезультатДействия, ОповещениеПриПодключенииИнтернетПоддержки)
	
	Если РезультатДействия.ВидОшибки = ПредопределенноеЗначение("Перечисление.ВидыОшибокСПАРКРиски.ВнутренняяОшибкаСервиса") Тогда
		
		ПоказатьПредупреждение(
			,
			НСтр("ka='Не удалось подключиться к сервису 1СПАРК Риски. Сервис временно недоступен."
"Повторите попытку подключения позже.';ru='Не удалось подключиться к сервису 1СПАРК Риски. Сервис временно недоступен."
"Повторите попытку подключения позже.'"));
		
	ИначеЕсли РезультатДействия.ВидОшибки = ПредопределенноеЗначение("Перечисление.ВидыОшибокСПАРКРиски.ИспользованиеЗапрещено") Тогда
		
		ПоказатьПредупреждение(
			,
			НСтр("ka='Использование сервиса 1СПАРК Риски недоступно в текущем режиме работы.';ru='Использование сервиса 1СПАРК Риски недоступно в текущем режиме работы.';en='The service 1SPARK Risks available in the current operation.'"));
		
	ИначеЕсли РезультатДействия.ВидОшибки = ПредопределенноеЗначение("Перечисление.ВидыОшибокСПАРКРиски.ОшибкаПодключения") Тогда
		
		ПараметрыФормы = Новый Структура("СообщениеОбОшибке, ИнформацияОбОшибке",
			РезультатДействия.СообщениеОбОшибке,
			РезультатДействия.ИнформацияОбОшибке);
		
		ОткрытьФорму(
			"Документ.СправкиСПАРКРиски.Форма.НеУдалосьПодключитьсяКСервису",
			ПараметрыФормы,
			ЭтотОбъект);
		
	ИначеЕсли РезультатДействия.ВидОшибки = ПредопределенноеЗначение("Перечисление.ВидыОшибокСПАРКРиски.ИнтернетПоддержкаНеПодключена") Тогда
		
		ПоказатьВопрос(
			Новый ОписаниеОповещения(
				"ПриОтветеНаВопросОПодключенииИнтернетПоддержки",
				ЭтотОбъект,
				ОповещениеПриПодключенииИнтернетПоддержки),
			НСтр("ka='Для работы с сервисом 1СПАРК Риски необходимо подключить Интернет-поддержку пользователей."
"Подключить?';ru='Для работы с сервисом 1СПАРК Риски необходимо подключить Интернет-поддержку пользователей."
"Подключить?'"),
			РежимДиалогаВопрос.ДаНет);
		
	ИначеЕсли ЗначениеЗаполнено(РезультатДействия.СообщениеОбОшибке) Тогда
		
		ПоказатьПредупреждение(, РезультатДействия.СообщениеОбОшибке);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОтветеНаВопросОПодключенииИнтернетПоддержки(КодВозврата, ОповещениеПриПодключенииИнтернетПоддержки) Экспорт
	
	Если КодВозврата <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ИнтернетПоддержкаПользователейКлиент.ПодключитьИнтернетПоддержкуПользователей(
		Новый ОписаниеОповещения("ПодключитьИнтернетПоддержкуЗавершение", ЭтотОбъект, ОповещениеПриПодключенииИнтернетПоддержки),
		ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьИнтернетПоддержкуЗавершение(Результат, ОповещениеПриПодключенииИнтернетПоддержки) Экспорт
	
	Если Результат <> Неопределено Тогда
		Если ОповещениеПриПодключенииИнтернетПоддержки <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(ОповещениеПриПодключенииИнтернетПоддержки);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗапроситьНовуюСправкуВСервисеСПАРКРиски()
	
	Если Не СПАРКРиски.ИспользованиеРазрешено() Тогда
		// Обеспечение безопасности серверных методов.
		ВызватьИсключение НСтр("ka='Использование недоступно в текущем режиме работы.';ru='Использование недоступно в текущем режиме работы.';en='The use is not available in the current operation.'");
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ВидОшибки"         , Перечисления.ВидыОшибокСПАРКРиски.ПустаяСсылка());
	Результат.Вставить("Сообщение"         , "");
	Результат.Вставить("СообщениеОбОшибке" , "");
	Результат.Вставить("ИнформацияОбОшибке", "");
	Результат.Вставить("СправкаСсылка"     , Документы.СправкиСПАРКРиски.ПустаяСсылка());
	
	ИдентификаторУслуги = СПАРКРискиКлиентСервер.ИдентификаторУслугиСправкиПоКомпаниям();
	Если Не ИнтернетПоддержкаПользователей.УслугаПодключена(ИдентификаторУслуги) Тогда
		
		// Проверка наличия услуги по данным ИБ выполняется на
		// прикладном уровне до вызова операции сервиса.
		РезультатВызоваОперации = Новый Структура;
		РезультатВызоваОперации.Вставить("ВидОшибки", Перечисления.ВидыОшибокСПАРКРиски.ТребуетсяОплатаИлиПревышенЛимит);
		РезультатВызоваОперации.Вставить("СообщениеОбОшибке",
			НСтр("ka='Услуга не подключена.';ru='Услуга не подключена.';en='The service is not connected.'"));
		РезультатВызоваОперации.Вставить("ИнформацияОбОшибке",
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ka='Не удалось запросить новую справку 1СПАРК Риски."
"Услуга с идентификатором %1 не подключена.';ru='Не удалось запросить новую справку 1СПАРК Риски."
"Услуга с идентификатором %1 не подключена.'"),
				ИдентификаторУслуги));
		
		СПАРКРиски.ЗаписатьИнформациюВЖурналРегистрации(РезультатВызоваОперации.ИнформацияОбОшибке);
		ПодготовитьОписаниеОшибки(Результат, РезультатВызоваОперации);
		Возврат Результат;
		
	КонецЕсли;
	
	СвойстваСправочниковКонтрагенты = СПАРКРиски.СвойстваСправочниковКонтрагентов();
	ТипКонтрагент = ТипЗнч(Контрагент);
	
	ОписаниеСправочника = СвойстваСправочниковКонтрагенты.Найти(ТипКонтрагент, "ТипСсылка");
	Если ОписаниеСправочника = Неопределено Тогда
		ТекстИсключения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ka='Неизвестный тип контрагента (%1). Необходимо заполнить описание справочника в методе"
"ПриОпределенииСвойствСправочниковКонтрагентов() общего модуля СПАРКРискиПереопределяемый.';ru='Неизвестный тип контрагента (%1). Необходимо заполнить описание справочника в методе"
"ПриОпределенииСвойствСправочниковКонтрагентов() общего модуля СПАРКРискиПереопределяемый.'"),
			ТипКонтрагент);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	ЗначенияРеквизитов = СПАРКРиски.ЗначенияРеквизитовКонтрагентов(Контрагент);
	Если ЗначенияРеквизитов.Количество() = 0 Тогда
		// Контрагент отсутствует в информационной базе.
		Результат.Сообщение = НСтр("ka='Не удалось получить данные контрагента. Данные контрагента были удалены или недостаточно прав.';ru='Не удалось получить данные контрагента. Данные контрагента были удалены или недостаточно прав.';en='Could not get the data of the counterparty. These counterparty have been removed or are not allowed.'");
		Возврат Результат;
	КонецЕсли;
	
	ДанныеКонтрагента     = ЗначенияРеквизитов[0];
	ДанныеКонтрагента.ИНН = СокрЛП(ДанныеКонтрагента.ИНН);
	ОшибкаИНН             = "";
	Если Не ДанныеКонтрагента.ПодлежитПроверке Тогда
		
		Результат.Сообщение = НСтр("ka='Выбранный контрагент не может быть проверен в сервисе 1СПАРК Риски.';ru='Выбранный контрагент не может быть проверен в сервисе 1СПАРК Риски.';en='The selected contractor can not be checked when 1SPARK risks.'");
		Возврат Результат;
		
	ИначеЕсли Не СПАРКРискиКлиентСервер.ИННСоответствуетТребованиям(ДанныеКонтрагента.ИНН, ОшибкаИНН) Тогда
		
		Результат.Сообщение = ОшибкаИНН;
		Возврат Результат;
		
	КонецЕсли;
	
	СписокИНН = Новый Массив;
	СписокИНН.Добавить(ДанныеКонтрагента.ИНН);
	РезультатВызоваОперации = СервисСПАРКРиски.НачатьПодготовкуСправок(СписокИНН);
	
	Если Не РезультатВызоваОперации.ВидОшибки.Пустая() Тогда
		ПодготовитьОписаниеОшибки(Результат, РезультатВызоваОперации);
		Возврат Результат;
	КонецЕсли;
	
	
	ИдентификаторСправки = РезультатВызоваОперации.ИдентификаторыСправок[ДанныеКонтрагента.ИНН];
	Если Не ЗначениеЗаполнено(ИдентификаторСправки) Тогда
		СПАРКРиски.ЗаписатьОшибкуВЖурналРегистрации(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ka='Ошибка при запросе новой справки для ИНН %1."
"Сервис не возвратил идентификатор справки.';ru='Ошибка при запросе новой справки для ИНН %1."
"Сервис не возвратил идентификатор справки.'"),
				ДанныеКонтрагента.ИНН));
		Результат.ВидОшибки = Перечисления.ВидыОшибокСПАРКРиски.ВнутренняяОшибкаСервиса;
	КонецЕсли;
	
	// Создать документ.
	СправкаОбъект = Документы.СправкиСПАРКРиски.СоздатьДокумент();
	СправкаОбъект.Дата          = РезультатВызоваОперации.ДатаЗапроса;
	СправкаОбъект.Контрагент    = Контрагент;
	СправкаОбъект.ИНН           = ДанныеКонтрагента.ИНН;
	СправкаОбъект.Состояние     = Перечисления.СостоянияСправкиСПАРКРиски.Готовится;
	СправкаОбъект.Идентификатор = ИдентификаторСправки;
	СправкаОбъект.Записать();
	
	ДобавитьЗаданиеПроверкиСостоянияГотовностиСправки(СправкаОбъект.Ссылка, ИдентификаторСправки);
	
	Элементы.Список.Обновить();
	Результат.СправкаСсылка = СправкаОбъект.Ссылка;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ДобавитьЗаданиеПроверкиСостоянияГотовностиСправки(Справка, ИдентификаторСправки)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("Использование", Истина);
	ПараметрыЗадания.Вставить("Метаданные",
		Метаданные.РегламентныеЗадания.ПроверкаГотовностиСправкиСПАРКРиски);
	ПараметрыЗадания.Вставить("Ключ", Строка(ИдентификаторСправки));
	
	ПараметрыМетода = Новый Массив;
	ПараметрыМетода.Добавить(Справка);
	ПараметрыЗадания.Вставить("Параметры", ПараметрыМетода);
	
	Задание = РегламентныеЗаданияСервер.ДобавитьЗадание(ПараметрыЗадания);
	
КонецФункции

&НаСервере
Функция ДанныеДляПросмотраФайлаСправки(Знач Справка)
	
	Результат = Новый Структура;
	Результат.Вставить("Сообщение"         , "");
	Результат.Вставить("ВидОшибки"         , Перечисления.ВидыОшибокСПАРКРиски.ПустаяСсылка());
	Результат.Вставить("СообщениеОбОшибке" , "");
	Результат.Вставить("ИнформацияОбОшибке", "");
	Результат.Вставить("ДанныеФайла"       , Неопределено);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	СправкиСПАРКРиски.Состояние КАК Состояние,
	|	СправкиСПАРКРиски.Идентификатор КАК ИдентификаторСправки,
	|	ЕСТЬNULL(СправкиСПАРКРискиПрисоединенныеФайлы.Ссылка, НЕОПРЕДЕЛЕНО) КАК ФайлСсылка,
	|	СправкиСПАРКРиски.ИНН
	|ИЗ
	|	Документ.СправкиСПАРКРиски КАК СправкиСПАРКРиски
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СправкиСПАРКРискиПрисоединенныеФайлы КАК СправкиСПАРКРискиПрисоединенныеФайлы
	|		ПО СправкиСПАРКРиски.Ссылка = СправкиСПАРКРискиПрисоединенныеФайлы.ВладелецФайла
	|ГДЕ
	|	СправкиСПАРКРиски.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Справка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Результат.Сообщение = НСтр("ka='Выбранная справка отсутствует в информационной базе или"
"недостаточно прав для просмотра.';ru='Выбранная справка отсутствует в информационной базе или"
"недостаточно прав для просмотра.'");
		Возврат Результат;
	КонецЕсли;
	
	СостоянияСправки = Перечисления.СостоянияСправкиСПАРКРиски;
	Состояние        = Выборка.Состояние;
	Если Состояние = СостоянияСправки.Получена Тогда
		
		Если Выборка.ФайлСсылка = Неопределено Тогда
			ФайлСсылка = Неопределено;
			ЗагрузитьФайлСправки(Справка, Выборка.ИдентификаторСправки, Выборка.ИНН, ФайлСсылка, Результат);
			Если ФайлСсылка <> Неопределено Тогда
				Результат.ДанныеФайла = ПрисоединенныеФайлы.ПолучитьДанныеФайла(
					ФайлСсылка,
					ЭтотОбъект.УникальныйИдентификатор);
			КонецЕсли;
		Иначе
			Результат.ДанныеФайла = ПрисоединенныеФайлы.ПолучитьДанныеФайла(
				Выборка.ФайлСсылка,
				ЭтотОбъект.УникальныйИдентификатор);
		КонецЕсли;
		
		Возврат Результат;
		
	ИначеЕсли Состояние = СостоянияСправки.Готовится Тогда
		
		ПроверитьСостояниеСправки(Справка, Выборка.ИдентификаторСправки, Состояние, Результат);
		Если Состояние <> СостоянияСправки.Готовится Тогда
			Элементы.Список.Обновить();
			Если Состояние = СостоянияСправки.Получена Тогда
				ФайлСсылка = Неопределено;
				ЗагрузитьФайлСправки(Справка, Выборка.ИдентификаторСправки, Выборка.ИНН, ФайлСсылка, Результат);
				Если ФайлСсылка <> Неопределено Тогда
					Результат.ДанныеФайла = ПрисоединенныеФайлы.ПолучитьДанныеФайла(
						ФайлСсылка,
						ЭтотОбъект.УникальныйИдентификатор);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Результат.ВидОшибки.Пустая() И Результат.ДанныеФайла = Неопределено Тогда
		
		Если Состояние = СостоянияСправки.Готовится Тогда
			Результат.Сообщение = НСтр("ka='На текущий момент подготовка справки не завершена."
"Повторите попытку позже.';ru='На текущий момент подготовка справки не завершена."
"Повторите попытку позже.'");
		Иначе
			// Справка не получена в связи с ошибкой подготовки справки в сервисе.
			Результат.Сообщение = НСтр("ka='Справка не может быть открыта для просмотра"
"в связи с ошибкой подготовки справки в сервисе 1СПАРК Риски.';ru='Справка не может быть открыта для просмотра"
"в связи с ошибкой подготовки справки в сервисе 1СПАРК Риски.'");
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗагрузитьФайлСправки(ДокументСсылка, ИдентификаторСправки, ИНН, ФайлСсылка, Результат)
	
	РезультатВызоваОперации = СервисСПАРКРиски.ЗагрузитьФайлСправки(ИдентификаторСправки);
	Если Не РезультатВызоваОперации.ВидОшибки.Пустая() Тогда
		ПодготовитьОписаниеОшибки(Результат, РезультатВызоваОперации);
		Возврат;
	КонецЕсли;
	
	ПараметрыФайла = Новый Структура;
	ПараметрыФайла.Вставить("Автор"           , Пользователи.АвторизованныйПользователь());
	ПараметрыФайла.Вставить("ВладелецФайлов"  , ДокументСсылка);
	ПараметрыФайла.Вставить("ИмяБезРасширения",
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ka='Справка 1СПАРК Риски %1';ru='Справка 1СПАРК Риски %1';en='Help 1SPARK Risks 1%'"),
			ИНН));
	ПараметрыФайла.Вставить("РасширениеБезТочки", "pdf");
	ПараметрыФайла.Вставить("ВремяИзмененияУниверсальное",
		ТекущаяУниверсальнаяДата());
	
	ФайлСсылка = ПрисоединенныеФайлы.ДобавитьПрисоединенныйФайл(
		ПараметрыФайла,
		ПоместитьВоВременноеХранилище(РезультатВызоваОперации.ФайлСправки));
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПроверитьСостояниеСправки(ДокументСсылка, ИдентификаторСправки, Состояние, Результат)
	
	Идентификаторы = Новый Массив;
	Идентификаторы.Добавить(ИдентификаторСправки);
	РезультатВызоваОперации = СервисСПАРКРиски.СостояниеПодготовкиСправок(Идентификаторы);
	Если Не РезультатВызоваОперации.ВидОшибки.Пустая() Тогда
		ПодготовитьОписаниеОшибки(Результат, РезультатВызоваОперации);
		Возврат;
	КонецЕсли;
	
	Состояние = РезультатВызоваОперации.СостояниеСправок[ИдентификаторСправки];
	Если Состояние = Неопределено Тогда
		Состояние = Перечисления.СостоянияСправкиСПАРКРиски.ОшибкаПодготовки;
	КонецЕсли;
	
	Если Состояние = Перечисления.СостоянияСправкиСПАРКРиски.Готовится Тогда
		Возврат;
	Иначе
		
		СПАРКРиски.УстановитьСостояниеСправки(ДокументСсылка, Состояние);
		
		СПАРКРиски.ОтменитьЗаданиеПроверкиГотовностиСправкиСПАРКРиски(ИдентификаторСправки);
		Если Состояние <> Перечисления.СостоянияСправкиСПАРКРиски.Получена Тогда
			СПАРКРиски.ЗаписатьОшибкуВЖурналРегистрации(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ka='Ошибка при подготовке справки с идентификатором %1."
"%2';ru='Ошибка при подготовке справки с идентификатором %1."
"%2'"),
					ИдентификаторСправки,
					Состояние));
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПодготовитьОписаниеОшибки(Результат, РезультатВызоваОперации)
	
	Результат.ВидОшибки = РезультатВызоваОперации.ВидОшибки;
	Если РезультатВызоваОперации.ВидОшибки = Перечисления.ВидыОшибокСПАРКРиски.ОшибкаПодключения Тогда
		
		Если Не Пользователи.ЭтоПолноправныйПользователь(, Истина, Ложь) Тогда
			Результат.Сообщение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ka='Не удалось подключиться к сервису 1СПАРК Риски."
"%1"
""
"Обратитесь к администратору.';ru='Не удалось подключиться к сервису 1СПАРК Риски."
"%1"
""
"Обратитесь к администратору.'"),
				РезультатВызоваОперации.СообщениеОбОшибке);
		Иначе
			Результат.СообщениеОбОшибке  = РезультатВызоваОперации.СообщениеОбОшибке;
			Результат.ИнформацияОбОшибке = РезультатВызоваОперации.ИнформацияОбОшибке;
		КонецЕсли;
		
	ИначеЕсли РезультатВызоваОперации.ВидОшибки = Перечисления.ВидыОшибокСПАРКРиски.ИнтернетПоддержкаНеПодключена
		И Не ИнтернетПоддержкаПользователей.ДоступноПодключениеИнтернетПоддержки() Тогда
		
		Результат.Сообщение = НСтр("ka='Для работы с сервисом 1СПАРК Риски необходимо подключить Интернет-поддержку пользователей."
"Обратитесь к администратору.';ru='Для работы с сервисом 1СПАРК Риски необходимо подключить Интернет-поддержку пользователей."
"Обратитесь к администратору.'");
		
	ИначеЕсли РезультатВызоваОперации.ВидОшибки = Перечисления.ВидыОшибокСПАРКРиски.ТребуетсяОплатаИлиПревышенЛимит Тогда
		
		Результат.СообщениеОбОшибке = ИнтернетПоддержкаПользователейКлиентСервер.ФорматированныйЗаголовок(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ka='<body>Сервис 1СПАРК Риски не подключен."
"<br/><a href=""%1"">Подробнее о сервисе</a></body>';ru='<body>Сервис 1СПАРК Риски не подключен."
"<br/><a href=""%1"">Подробнее о сервисе</a></body>'"),
				СПАРКРискиКлиентСервер.АдресСтраницыОписанияСервисаСПАРКРиски()));
		
	ИначеЕсли РезультатВызоваОперации.ВидОшибки = Перечисления.ВидыОшибокСПАРКРиски.ОшибкаАутентификации Тогда
		
		Если Не Пользователи.ЭтоПолноправныйПользователь(, Истина, Ложь) Тогда
			Результат.СообщениеОбОшибке = НСтр("ka='Ошибка аутентификации в сервисе 1СПАРК Риски.';ru='Ошибка аутентификации в сервисе 1СПАРК Риски.';en='authentication error when 1SPARK risks.'");
		Иначе
			Результат.СообщениеОбОшибке =
				НСтр("ru = 'Ошибка аутентификации в сервисе 1СПАРК Риски.
					|Обратитесь к администратору.'");
		КонецЕсли;
		
	Иначе
		
		Результат.СообщениеОбОшибке = РезультатВызоваОперации.СообщениеОбОшибке;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
